/* 
  - useForm 
  ---- هو هوك مخصص لإدارة النماذج بسهولة ويجعل الكمبونانت لا يتم تحديثه عند تغير قيم الانبوتس ودا امر مهم 
  ---- ويجعل المكون بتاعي سريع وبجوده ثابتهم

  - register 
  ---- هو اول بروبس من البروبسيس الخاصه بالهوك وبتخلني اتتبع كل الحالات الي بيتعرض ليها الانبوت بتاعنا من تغير قيمه 
  ---- وظهور اخطاء واشياء اخره المثال التالي سيوضح كيفيه استخدامها مع الانبوت 

  - const { onChange, onBlur, name, ref } = register('firstName'); 
  ---- دي كل الخواص بتاعت الفانكشن بتاعتنا وازاي نستخدمها 
  ---- ليست الطريقه الصحيحه 
  <input 
    onChange={onChange} // assign onChange event 
    onBlur={onBlur} // assign onBlur event
    name={name} // assign name prop
    ref={ref} // assign ref prop
  />

  ---- هذه هي الطريقه الصحيحه لاستخدامها مع الانبوت
  <input {...register('firstName')} />

  - handleSubmit 
  ---- تاني بروبس موجوده داخل الهوك بتاعتنا وتستخدم في عمل سبمت للنموذج وتاخذ بداخلها فانكشن لتقوم ببعض الاكواد في 
  ---- حاله ارسال البيانات من النموج للسيرفر ولا تقوم بعمل اعاده تحميل للصفحه وهذا مما يحسن جوده موقعنا

  - DevTool 
  ---- دي اداه بتخلني اشوف كل التغيرات الي بتحصل علي الانبوتس بتاعتي بشكل سهل جدا
*/